# Advanced_LAB_Part_2

<aside>
üí°

Toute la configuration pr√©c√©dente √† √©t√© effectu√© dans le lab pr√©c√©dent m√™me si entre temps  du nouveau mat√©riel et des config basique ont √©t√© apport√©s voir modifi√©s pour les diff√©rents points abord√©s de ce lab ( serveurs Web, Radius etc‚Ä¶)

PS : repartez du fichier fournit dans le repo pour √©viter les conflits.

## Sommaire

- [Radius-AAA-Admin](#Radius-AAA-Admin)
- [Radius-AAA-Users](#Radius-AAA-Users )
- [DHCP Snooping](#DHCP-Snooping)
- [ARP Poisoning](#ARP-Poisoning)
- [DMZ](#DMZ)

</aside>

```xml
# Commandes utiles

# Voir les interfaces
Switch#sh ip int brief

# Voir la table des adresses MAC 
Switch#sh mac address-table

# Voir les ACL
Router#sh ip access
```

## Radius-AAA-Admin

> Le seveur radius et le switch ont d√©j√† une adresse IP (statique) exclues de la rnge du DHCP du Router7

<aside>
üí°

> Tout les √©quipements r√©seaux qui doivent utiliser Radius doivent √™tre renseign√© dans le serveur, ex : je veux me connecter √† cet √©quipement avec ce compte d√©finit dans Radius alors je dois configurer l‚Äô√©quipement en question

> Router, switch ‚Ä¶ ‚áí **Dans un but d‚Äôadministration (via SSH ou Telnet)**

> **Attention** : les adresses IP sont obtenues via DHCP et les IP ont leur importances pour le serveur Radius au niveau des √©quipements r√©seau alors v√©rifi√© la config sinon aller voir en Annex pour modifier le serveur Radius ( facile ).

</aside>

### Switch2

> Il faut donc ajout√© une IP au switch (qui sera renseign√© dans la config du serveur radius)

```xml
Switch(config)#int vlan 1
Switch(config-if)#ip address 192.168.1.100 255.255.255.0
Switch(config-if)#no shutdown
Switch(config-if)#exit
```

```xml
Switch(config)#aaa new-model
Switch(config)#radius-server host 192.168.1.2 key password
Switch(config)#aaa authentication login default group radius
Switch(config)#aaa authentication enable default group radius
Switch(config)#exit
```

<aside>
üí°

> Une fois configurer on peut configurer notre switch √† distance avec un compte Radius (toto : toto); on peut faire ‚Äútelnet 192.168.1.100‚Äù ( 192.168.1.100 √©tant l‚Äôip du switch)

</aside>

### Router7

```xml
Router(config)#aaa new-model
Router(config)#radius server Main
Router(config-radius-server)#address ipv4 192.168.1.2
Router(config-radius-server)#key password
Router(config-radius-server)#aaa authentication login default group radius
Router(config)#aaa authentication enable default group radius
```

## Radius-AAA-Users

### Switch2

> Une partie de la configuration est commune √† celle pr√©c√©dente (ou je sp√©cifie qui est le serveur Radius) donc je ne la refais pas
>
> Switch(config)#aaa new-model
> Switch(config)#radius-server host 192.168.1.2 key password

```xml
Switch(config)#aaa authentication dot1x default group radius
Switch(config)#dot1x system-auth-control
Switch(config)#int fa0/2
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 1
Switch(config-if)#authentication port-control auto
Switch(config-if)#dot1x pae authenticator
Switch(config-if)#no shutdown
Switch(config-if)#exit
```

<aside>
üí°

> On doit configurer TOUS les ports que l‚Äôon veut s√©curis√©, dans notre cas on ne fait que fa0/2 car on a que ce pc connect√© au switch.

</aside>

### PC 6

Il faut aller dans ‚ÄúDesktop‚Äù ‚Üí ‚ÄúIP Configuration‚Äù ‚Üí 802.1x

Puis ajout√© le user/mdp cr√©√© dans le serveur Radius ( login : toto ; mdp : toto )

## DHCP Snooping

<aside>
üí°

> On empeche des r√©ponses DHCP provennant d‚Äôune machine tiers sur le r√©seau. Un serveur DHCP en plus mettrait notre r√©seau √† plat (mauvaise config ou intentionnelle)

</aside>

### Switch1(1)

```xml
Switch(config)#ip dhcp snooping
Switch(config)#ip dhcp snooping vlan 10
Switch(config)#int f0/1-3
Switch(config-if)#ip dhcp snooping trust
```

> Interface f0/1 est l‚Äôinterface du switch connect√© au routeur, les r√©ponses et les requ√™tes dhcp peuvent passer par ces ports uniquement.

> La mise en place de cette s√©curit√© permet aussi de lutter contre les usurpations d‚Äôip addr√©sser dynamiquement car le switch sait quelle IP correspond √† quelle MAC et va drop les r√©ponse ARP avec les MACs malveillantes sur le r√©seau.

## ARP Poisoning

> Dans un premier temps on va d√©sactiver tout les ports qui ne sont pas utilis√©s pour √©viter qu‚Äôun attaquant se branche sur le switch.

### Swtich1

```xml
Switch1(config)#int range f0/5-24
Switch(config-if)#shutdown
Switch(config-if)#exit
Switch1(config)#int g0/1-2
Switch(config-if)#shutdown
Switch(config-if)#exit
```

```xml
Switch(config)#int f0/1-4
Switch(config-if-range)#switchport port-security mac-address sticky
Switch(config-if-range)#switchport port-security maximum 1
Switch(config-if-range)#switchport port-security violation protect
Switch(config-if-range)#switchport port-security
```

<aside>
üí°

> On aurait pu configurer ca autrement en configurant directement sur chaque port l‚Äôadresse mac des machines. Cependant ici on a un petit cot√© dynamique, la premiere MAC apprise est celle qui va rest√© et il y a plusieurs options de r√©ponse a une ‚Äúviolation‚Äù on choisit protect qui drop les paquets provenant d‚Äôune MAC diff√©rente.

</aside>

## DMZ

<aside>
üí°

> Avant de r√©aliser la DMZ il a fallu ajout√© une interface (extension) GigaEthernet au routeur et donc l‚Äô√©teindre sauf qu‚Äôil faut sauvegarder sa configuration ‚Äúrunning config‚Äù dans la startup config (celle du d√©marrage) ; soit ‚Äúwrite memory‚Äù soit ‚Äúcopy running-config startup-config‚Äù

</aside>

### Router0 (NAT)

```xml
Router(config)#ip nat inside source static tcp 10.10.10.2 80 30.30.30.2 80
Router(config)#ip nat inside source static tcp 10.10.10.2 443 30.30.30.2 443
Router(config)#ip nat inside source static 10.10.10.2 30.30.30.2 
```

> On fait de la redirection de port vers notre server web pour le http (80) et le https (443)

> On fait de la translation d‚Äôadresse ( NAT Statique 1:1) pour que les r√©ponses de notre server prenne l‚Äôip publique du routeur en IP source car on ne vas pas router un paquet avec une ip source publique car personne sur le r√©seau ne pourra r√©pondre ou m√™me comprendre c‚Äô√©tait la r√©ponse √† quelle requ√™te.

### Router0 (ACL)

```xml
Router(config)#ip access-list extended dmz-in
Router(config-ext-nacl)#permit tcp  any host 30.30.30.2 eq 80
Router(config-ext-nacl)#permit tcp  any host 30.30.30.2 eq 443
Router(config-ext-nacl)#permit tcp any host 30.30.30.2 established
Router(config-ext-nacl)#permit icmp any host 30.30.30.2 echo-reply
Router(config-ext-nacl)#exit

Router(config)#int s0/0/0
Router(config-if)#ip access-group dmz-in in
Router(config-if)#exit

Router(config)#ip access-list extended dmz-out
Router(config-ext-nacl)#permit tcp any any established
Router(config-ext-nacl)#permit icmp any any echo-reply
Router(config-ext-nacl)#exit

Router(config)#int g0/0
Router(config-if)#ip access-group dmz-out in
Router(config-if)#exit

```

<aside>
üí°

> On a cr√©√© des ACL √©tendues pour pouvoir faire du filtrage sur le port (cot√© publique) de notre Routeur0.

> Ici on autorise le traffique HTTP et HTTPS √† passer ( 2 premieres lignes permit).

> Les deux dernieres lignes permit c‚Äôest pour nos pc du lan 192.168.1.0/25 et 192.168.1.128/25 afin de pouvoir pinguer le reste du monde et de se connecter √† des serveurs.

> Attention : par d√©faut a la fin d‚Äôune ACL on a un deny any ‚áí tout ce qui n‚Äôest pas autoris√© est interdit !

> L‚Äô ACL √©tendue dmz-out permet de filtrer les paquets enovy√© depuis le serveur dans un soucis de prot√©ger notre LAN ( r√©seau vert ).

> On va permettre a nos pc de joindre le serveur sur son IP priv√© (en HTTP et HTTPS) ainsi que de le pinguer mais tout le reste est interdit pour pas qu‚Äôun attaquant puisse rebondir sur le serveur et attaquer notre LAN.

</aside>

# Informations

<aside>
üí°

> Je ferais une suite encore √† ce lab dans une partie 3 ou j‚Äôirais plus loin sur la s√©curit√© avec d‚Äôautres ACL √©tendues, des tunnels etc‚Ä¶

</aside>

## Annexes

> Comme il n‚Äôest pas int√©rressant de configurer notre serveur Radius sur Cisco Packet Tracer la configuration est d√©ja faites (configuration graphique )

> Dans la partie Network Configuration on ajoute les √©quipements r√©seaux qui vont utiliser le serveur Radius donc √† minima le switch mais si on veut s‚Äôauthentifier au routeur avec un compte user d√©finit dans radius alors on l‚Äôajoute aussi

![Capture d‚Äô√©cran du 2025-11-10 15-20-54.png](images/Capture_dcran_du_2025-11-10_15-20-54.png)

> Dans la partie User Setup on met les compte user/mdp que l‚Äôon va utiliser sur nos PC.

![Capture d‚Äô√©cran du 2025-11-10 15-36-36.png](images/Capture_dcran_du_2025-11-10_15-36-36.png)
